Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp


#include "dfr1154_cam_controller.h"

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DFRobot_LTR308.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <Wire.h>
#include <esp_camera.h>
#include <esp_system.h>
#include <array>
#include <math.h>
#include <memory>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include <utility>

#include "camera_common.h"
#include "bounded_mqtt_socket.h"
#include "mqtt_status_batch.h"
#include "dfr1154_camera_gain.h"
#include "dfr1154_config.h"
#include "dfr1154_environment.h"
#include "dfr1154_pins.h"
#include "dfr1154_server_capture.h"
#include "dfr1154_victron.h"
#include "esp32_rtsp_streamer.h"

namespace {

WiFiServer g_rtspServer(dfrcfg::kRtspPort);
BoundedMqttSocket g_mqttSocket;
PubSubClient g_mqttClient(g_mqttSocket);
Preferences g_preferences;
DFRobot_LTR308 g_lightSensor;
std::unique_ptr<Esp32RtspStreamer> g_streamer;

bool g_cameraReady = false;
bool g_psramReady = false;
bool g_lightReady = false;
bool g_wifiStarted = false;
bool g_rtspServerStarted = false;
bool g_mdnsReady = false;
bool g_timeConfigured = false;
bool g_streamEnabled = true;
bool g_networkServicesPending = false;
bool g_otaReady = false;
bool g_otaActive = false;
bool g_mqttEverConnected = false;
bool g_victronBeginAttempted = false;
bool g_statusPublishPending = false;
bool g_configPublishPending = false;
// One bounded snapshot, never a growing history of status packets.
MqttStatusBatch<String, 96> g_statusBatch(12 * 1024);
bool g_statusBatchBuildFailed = false;
bool g_statusBatchHasConfig = false;
bool g_statusBatchHasBme = false;
String g_statusBatchConfig;
String g_previousStatusConfig;
bool g_statusSendStarted = false;
uint32_t g_lastStatusSendMs = 0;
bool g_bmePublishScheduleStarted = false;
uint32_t g_lastBmePublishMs = 0;
bool g_mqttSessionActive = false;
uint32_t g_mqttConnectedAtMs = 0;
size_t g_nextMqttSubscription = 0;
bool g_preferencesReady = false;
bool g_loopWdtReady = false;

volatile bool g_wifiGotIpEvent = false;
volatile bool g_wifiDisconnectedEvent = false;
volatile uint8_t g_wifiDisconnectReason = 0;
portMUX_TYPE g_wifiEventMux = portMUX_INITIALIZER_UNLOCKED;

framesize_t g_frameSize = FRAMESIZE_UXGA;
int g_jpegQuality = 10;
int g_brightness = 1;
int g_contrast = 0;
int g_saturation = -2;
int g_sharpness = 0;
int g_hmirror = 0;
int g_vflip = 1;
int g_ledEnabled = 0;
int g_streamFps = dfrcfg::kDefaultRtspFps;

// OV3660 controls exposed by DFRobot's CameraWebServer example.
int g_gainCeiling = dfrcamgain::kDefaultIndex;
int g_colorbar = 0;
int g_awb = 1;
int g_agc = 1;
int g_aec = 1;
int g_awbGain = 1;
int g_agcGain = 0;
int g_aecValue = 300;
int g_aec2 = 0;
int g_dcw = 1;
int g_bpc = 0;
int g_wpc = 1;
int g_rawGma = 1;
int g_lenc = 1;
int g_specialEffect = 0;
int g_wbMode = 0;
int g_aeLevel = 0;

// 0 = off, 1 = on, 2 = automatic from the LTR-308.
int g_irMode = 2;
bool g_irEnabled = false;
float g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
float g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
float g_ambientLux = NAN;

String g_lastStatus = "booting";
String g_lastError;
uint32_t g_lastWifiAttemptMs = 0;
uint32_t g_lastMqttAttemptMs = 0;
uint32_t g_lastFrameAtMs = 0;
uint32_t g_lastStatsMs = 0;
uint32_t g_lastLightReadMs = 0;
uint32_t g_lastLightProbeMs = 0;
uint32_t g_framesSent = 0;
uint32_t g_lastCameraRecoveryAttemptMs = 0;
uint32_t g_wifiReconnectCount = 0;
uint32_t g_mqttReconnectCount = 0;
uint32_t g_cameraRecoveryCount = 0;
uint32_t g_mqttPublishFailures = 0;
uint32_t g_mqttSubscribeFailures = 0;
uint32_t g_statusBatchFailures = 0;
int g_lastMqttDisconnectState = 0;
const char *g_lastMqttFailurePhase = "none";
uint32_t g_wifiAttemptCount = 0;
uint32_t g_mqttAttemptCount = 0;
uint8_t g_cameraRecoveryFailures = 0;
bool g_cameraRecoveryPending = false;
float g_lastMeasuredFps = 0.0f;
esp_reset_reason_t g_bootResetReason = ESP_RST_UNKNOWN;

String g_lastCommandId;
String g_lastCommandName;
String g_lastCommandResult = "none";
String g_lastCommandMessage;
uint32_t g_lastCommandAtMs = 0;
struct PendingMqttMessage {
  String topic;
  String payload;
};
// PubSubClient callbacks also run while a frame is being sent. Queue commands
// until the main loop can safely apply them without destroying that streamer.
std::array<PendingMqttMessage, 8> g_pendingMqttMessages;
size_t g_pendingMqttHead = 0;
size_t g_pendingMqttCount = 0;
uint32_t g_mqttCommandDrops = 0;

int clampValue(int value, int minimum, int maximum) {
  return camcommon::clampInt(value, minimum, maximum);
}

String mqttTopic(const char *suffix) {
  return String(dfrcfg::kMqttBaseTopic) + "/" + suffix;
}

int directSessionCount() {
  return g_streamer != nullptr ? g_streamer->sessionCount() : 0;
}

int directStreamingSessionCount() {
  return g_streamer != nullptr ? g_streamer->streamingSessionCount() : 0;
}

const char *frameSizeName() {
  return camcommon::frameSizeName(g_frameSize);
}

framesize_t frameSizeFromIndex(int index) {
  return camcommon::frameSizeFromIndex(index, g_frameSize, true);
}

int frameSizeToIndex(framesize_t size) {
  return camcommon::frameSizeToIndex(size, 2);
}

const char *irModeName() {
  switch (g_irMode) {
    case 0: return "off";
    case 1: return "on";
    default: return "auto";
  }
}

String rtspUrl() {
  if (WiFi.status() != WL_CONNECTED) return "";
  return camcommon::rtspUrl(
      WiFi.localIP(), dfrcfg::kRtspPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
}

String streamState() {
  if (g_otaActive) return "updating";
  if (g_cameraRecoveryPending) return "recovering";
  if (!g_cameraReady) return "camera_error";
  if (WiFi.status() != WL_CONNECTED) return "wifi_down";
  if (!g_streamEnabled) return "paused";
  return directStreamingSessionCount() > 0 ? "streaming" : "ready";
}

void publishStatus(bool forceConfig = false);
void flushStatus();
void configureLightSensor();

uint32_t boundedReconnectDelay(uint32_t attempts, uint32_t initialMs, uint32_t maximumMs) {
  uint32_t delayMs = initialMs;
  const uint32_t steps = attempts > 1 ? attempts - 1 : 0;
  for (uint32_t index = 0; index < steps && delayMs < maximumMs; ++index) {
    delayMs = delayMs > maximumMs / 2UL ? maximumMs : delayMs * 2UL;
  }
  return delayMs;
}

const char *resetReasonName(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON: return "power_on";
    case ESP_RST_EXT: return "external";
    case ESP_RST_SW: return "software";
    case ESP_RST_PANIC: return "panic";
    case ESP_RST_INT_WDT: return "interrupt_watchdog";
    case ESP_RST_TASK_WDT: return "task_watchdog";
    case ESP_RST_WDT: return "other_watchdog";
    case ESP_RST_DEEPSLEEP: return "deep_sleep";
    case ESP_RST_BROWNOUT: return "brownout";
    case ESP_RST_SDIO: return "sdio";
    default: return "unknown";
  }
}

