Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
void publishStatus(bool forceConfig) {
  g_statusPublishPending = true;
  g_configPublishPending = g_configPublishPending || forceConfig;
  if (forceConfig) {
    // A new command/reconnect supersedes an older snapshot. Never let its
    // response wait behind a nearly full batch of obsolete telemetry.
    discardStatusBatch();
  }
}

String buildMqttDiagnostics() {
  const auto &failure = g_mqttSocket.lastFailure();
  String json;
  json.reserve(768);
  json = "{\"firmware\":\"" + String(dfrcfg::kFirmwareVersion) + "\"";
  json += ",\"uptime_seconds\":" + String(millis() / 1000UL);
  json += ",\"reset_reason\":\"" + String(resetReasonName(g_bootResetReason)) + "\"";
  json += ",\"wifi_reconnects\":" + String(g_wifiReconnectCount);
  json += ",\"mqtt_reconnects\":" + String(g_mqttReconnectCount);
  json += ",\"publish_failures\":" + String(g_mqttPublishFailures);
  json += ",\"subscribe_failures\":" + String(g_mqttSubscribeFailures);
  json += ",\"status_queue_failures\":" + String(g_statusBatchFailures);
  json += ",\"write_failures\":" + String(g_mqttSocket.failureCount());
  json += ",\"last_phase\":\"" + String(g_lastMqttFailurePhase) + "\"";
  json += ",\"last_disconnect_state\":" + String(g_lastMqttDisconnectState);
  json += ",\"last_write_reason\":\"" + String(BoundedMqttSocket::reasonName(failure.reason)) + "\"";
  json += ",\"last_write_errno\":" + String(failure.errorNumber);
  json += ",\"last_write_ms\":" + String(failure.elapsedMs);
  json += ",\"last_write_sent\":" + String(static_cast<unsigned>(failure.sentBytes));
  json += ",\"last_write_total\":" + String(static_cast<unsigned>(failure.totalBytes));
  json += "}";
  return json;
}

void buildStatusBatch() {
  const bool forceConfig = g_configPublishPending;
  g_statusPublishPending = false;
  g_configPublishPending = false;

  queueStatus("status/online", "true");
  // Send the small diagnostic snapshot before the regular status/sensor batch.
  queueStatus("status/mqtt_diagnostics", buildMqttDiagnostics());
  queueStatus("status/command/id", g_lastCommandId);
  queueStatus("status/command/name", g_lastCommandName);
  queueStatus("status/command/result", g_lastCommandResult);
  queueStatus("status/command/message", g_lastCommandMessage);
  queueStatus("status/command/at_ms", String(g_lastCommandAtMs));
  queueStatus("status/state", streamState());
  queueStatus("status/error", g_lastError);
  queueStatus("status/ip", WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "-");
  queueStatus("status/rtsp_url", rtspUrl());
  queueStatus("status/mdns", String(dfrcfg::kMdnsHostname) + ".local");
  queueStatus("status/last_status", g_lastStatus);
  queueStatus("status/clients", String(directStreamingSessionCount()));
  queueStatus("status/direct_sessions", String(directSessionCount()));
  queueStatus("status/direct_streaming_clients", String(directStreamingSessionCount()));
  queueStatus("status/frame_fps", String(g_lastMeasuredFps, 1));
  queueStatus("status/configured_fps", String(g_streamFps));
  queueStatus("status/mqtt_connected", "true");
  queueStatus("status/wifi_rssi", String(WiFi.RSSI()));
  queueStatus("status/uptime_seconds", String(millis() / 1000UL));
  queueStatus("status/free_heap_bytes", String(ESP.getFreeHeap()));
  queueStatus("status/min_free_heap_bytes", String(ESP.getMinFreeHeap()));
  queueStatus("status/reset_reason", resetReasonName(g_bootResetReason));
  queueStatus("status/firmware_version", dfrcfg::kFirmwareVersion);
  queueStatus("status/wifi_reconnect_count", String(g_wifiReconnectCount));
  queueStatus("status/mqtt_reconnect_count", String(g_mqttReconnectCount));
  queueStatus("status/camera_recovery_count", String(g_cameraRecoveryCount));
  queueStatus("status/mqtt_publish_failures", String(g_mqttPublishFailures));
  queueStatus("status/mqtt_command_drops", String(g_mqttCommandDrops));
  queueStatus("status/ambient_lux", isfinite(g_ambientLux) ? String(g_ambientLux, 2) : "-");
  queueStatus("status/ir_mode", irModeName());
  queueStatus("status/ir_enabled", g_irEnabled ? "true" : "false");
  queueStatus("status/light_sensor", g_lightReady ? "ready" : "unavailable");
  queueExternalSensors();
  queueStatus("status/capture_request/state", dfrcapture::state());
  queueStatus("status/capture_request/enabled", dfrcapture::enabled() ? "true" : "false");
  queueStatus("status/capture_request/interval_seconds", String(dfrcapture::intervalSeconds()));

  const String config = buildConfigJson();
  if (forceConfig || config != g_previousStatusConfig) {
    queueStatus("status/config", config);
    g_statusBatchConfig = config;
    g_statusBatchHasConfig = true;
    if (g_statusBatchConfig.length() != config.length()) g_statusBatchBuildFailed = true;
  }
  if (g_statusBatchBuildFailed) {
    ++g_statusBatchFailures;
    g_lastMqttFailurePhase = "status_queue";
    discardStatusBatch();
    g_statusPublishPending = true;
    g_configPublishPending = true;
    statusf("mqtt status batch allocation/capacity failure count=%lu",
            static_cast<unsigned long>(g_statusBatchFailures));
  }
}

// At most two small MQTT packets per pass, with a pause between passes.
// The main loop continues servicing OTA, camera, IR and BLE between them.
void flushStatus() {
  if (g_otaActive || !g_mqttClient.connected()) return;
  const uint32_t now = millis();
  if (g_statusSendStarted && now - g_lastStatusSendMs < 20UL) return;
  g_statusSendStarted = true;
  g_lastStatusSendMs = now;

  if (g_statusBatch.empty()) {
    if (!g_statusPublishPending) return;
    buildStatusBatch();
  }
  for (unsigned sent = 0; sent < 2 && !g_statusBatch.empty(); ++sent) {
    const auto *message = g_statusBatch.front();
    if (!publishSimple(message->suffix, message->value)) {
      discardStatusBatch();
      g_statusPublishPending = true;
      g_configPublishPending = true;
      return;
    }
    g_statusBatch.pop();
    // Safe here: outside PubSubClient's write/callback. Receive SUBACKs,
    // commands and keepalive replies instead of only filling the TX queue.
    g_mqttClient.loop();
    if (!g_mqttClient.connected()) return;
    if (g_statusBatch.empty()) {
      if (g_statusBatchHasConfig) g_previousStatusConfig = g_statusBatchConfig;
      if (g_statusBatchHasBme) g_lastBmePublishMs = millis();
      discardStatusBatch();
    }
  }
}

bool saveControllerSettings() {
  if (!g_preferencesReady) {
    setError("settings storage unavailable");
    return false;
  }
  // Each Preferences put commits to flash. A one-slider change must not write
  // every setting again, especially while the camera is streaming.
  const struct { const char *key; int value; } integers[] = {
      {"framesize", frameSizeToIndex(g_frameSize)}, {"quality", g_jpegQuality},
      {"fps", g_streamFps}, {"bright", g_brightness}, {"contrast", g_contrast},
      {"saturate", g_saturation}, {"sharp", g_sharpness}, {"gainceil", g_gainCeiling},
      {"colorbar", g_colorbar}, {"awb", g_awb}, {"agc", g_agc}, {"aec", g_aec},
      {"awbgain", g_awbGain}, {"agcgain", g_agcGain}, {"aecvalue", g_aecValue},
      {"aec2", g_aec2}, {"dcw", g_dcw}, {"bpc", g_bpc}, {"wpc", g_wpc},
      {"rawgma", g_rawGma}, {"lenc", g_lenc}, {"effect", g_specialEffect},
      {"wbmode", g_wbMode}, {"aelevel", g_aeLevel}, {"hmirror", g_hmirror},
      {"vflip", g_vflip}, {"irmode", g_irMode}};
  bool success = true;
  for (const auto &setting : integers) {
    if ((!g_preferences.isKey(setting.key) ||
         g_preferences.getInt(setting.key) != setting.value) &&
        g_preferences.putInt(setting.key, setting.value) != sizeof(int32_t)) {
      success = false;
    }
    if (g_loopWdtReady) feedLoopWDT();
  }
  const auto saveBool = [&](const char *key, bool value) {
    if ((!g_preferences.isKey(key) || g_preferences.getBool(key) != value) &&
        g_preferences.putBool(key, value) != sizeof(uint8_t)) success = false;
  };
  const auto saveFloat = [&](const char *key, float value) {
    if ((!g_preferences.isKey(key) || g_preferences.getFloat(key) != value) &&
        g_preferences.putFloat(key, value) != sizeof(float)) success = false;
  };
  saveBool("led", g_ledEnabled != 0);
  saveBool("stream", g_streamEnabled);
  saveFloat("ironlux", g_irOnBelowLux);
  saveFloat("irofflux", g_irOffAboveLux);
  if (!success) setError("settings applied but saving to flash failed");
  return success;
}

void loadControllerSettings() {
  const uint8_t configVersion = g_preferences.getUChar("cfgver", 0);
  g_frameSize = frameSizeFromIndex(clampValue(g_preferences.getInt("framesize", 6), 0, 7));
  g_jpegQuality = clampValue(g_preferences.getInt("quality", 10), 4, 63);
  g_streamFps = clampValue(g_preferences.getInt("fps", dfrcfg::kDefaultRtspFps), 1, 20);
  g_brightness = clampValue(g_preferences.getInt("bright", 1), -2, 2);
  g_contrast = clampValue(g_preferences.getInt("contrast", 0), -2, 2);
  g_saturation = clampValue(g_preferences.getInt("saturate", -2), -2, 2);
  g_sharpness = clampValue(g_preferences.getInt("sharp", 0), -2, 2);
  const bool gainSettingExists = g_preferences.isKey("gainceil");
  const int storedGainIndex = g_preferences.getInt("gainceil", -1);
  g_gainCeiling = dfrcamgain::loadIndex(storedGainIndex, gainSettingExists, configVersion);
  g_colorbar = g_preferences.getInt("colorbar", 0) ? 1 : 0;
  g_awb = g_preferences.getInt("awb", 1) ? 1 : 0;
  g_agc = g_preferences.getInt("agc", 1) ? 1 : 0;
  g_aec = g_preferences.getInt("aec", 1) ? 1 : 0;
  g_awbGain = g_preferences.getInt("awbgain", 1) ? 1 : 0;
  g_agcGain = clampValue(g_preferences.getInt("agcgain", 0), 0, 30);
  g_aecValue = clampValue(g_preferences.getInt("aecvalue", 300), 0, 1200);
  g_aec2 = g_preferences.getInt("aec2", 0) ? 1 : 0;
  g_dcw = g_preferences.getInt("dcw", 1) ? 1 : 0;
  g_bpc = g_preferences.getInt("bpc", 0) ? 1 : 0;
  g_wpc = g_preferences.getInt("wpc", 1) ? 1 : 0;
  g_rawGma = g_preferences.getInt("rawgma", 1) ? 1 : 0;
  g_lenc = g_preferences.getInt("lenc", 1) ? 1 : 0;
  g_specialEffect = clampValue(g_preferences.getInt("effect", 0), 0, 6);
  g_wbMode = clampValue(g_preferences.getInt("wbmode", 0), 0, 4);
  g_aeLevel = clampValue(g_preferences.getInt("aelevel", 0), -2, 2);
  g_hmirror = g_preferences.getInt("hmirror", 0) ? 1 : 0;
  g_vflip = g_preferences.getInt("vflip", 1) ? 1 : 0;
  g_ledEnabled = g_preferences.getBool("led", false) ? 1 : 0;
  g_streamEnabled = g_preferences.getBool("stream", true);
  g_irMode = clampValue(g_preferences.getInt("irmode", 2), 0, 2);
  g_irOnBelowLux = g_preferences.getFloat("ironlux", dfrcfg::kDefaultIrOnBelowLux);
  g_irOffAboveLux = g_preferences.getFloat("irofflux", dfrcfg::kDefaultIrOffAboveLux);
  if (!isfinite(g_irOnBelowLux) || g_irOnBelowLux < 0 || g_irOnBelowLux > 100000)
    g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
  if (!isfinite(g_irOffAboveLux) || g_irOffAboveLux < 1 || g_irOffAboveLux > 100002)
    g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
  if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;

  // This migration changes only the gain selection and its version marker;
  // preserve every other stored camera, exposure and IR setting.
  if (!dfrcamgain::persistMigration(
          configVersion,
          [&]() {
            return g_preferencesReady &&
                ((gainSettingExists && storedGainIndex == g_gainCeiling) ||
                 g_preferences.putInt("gainceil", g_gainCeiling) == sizeof(int32_t));
          },
          [&](uint8_t version) {
            return g_preferences.putUChar("cfgver", version) == sizeof(uint8_t);
          })) {
    setError("gain ceiling migration could not be saved; will retry after restart");
  }
}

bool applySensorSettings(bool rebuildAfter) {
  sensor_t *sensor = esp_camera_sensor_get();
  if (sensor == nullptr) {
    setError("camera sensor unavailable");
    return false;
  }
  bool success = true;
  String failedSetting;
  const auto check = [&](int result, const char *name) {
    if (result == 0) return;
    success = false;
    if (failedSetting.length() == 0) failedSetting = name;
  };

  check(sensor->set_framesize(sensor, g_frameSize), "framesize");
  check(sensor->set_quality(sensor, g_jpegQuality), "jpeg_quality");
  check(sensor->set_brightness(sensor, g_brightness), "brightness");
  check(sensor->set_contrast(sensor, g_contrast), "contrast");
  check(sensor->set_saturation(sensor, g_saturation), "saturation");
  check(sensor->set_sharpness(sensor, g_sharpness), "sharpness");
  const bool gainApplied = dfrcamgain::applyGainCeiling(g_gainCeiling, [&](uint16_t raw) {
    return sensor->set_gainceiling(sensor, static_cast<gainceiling_t>(raw)) == 0;
  });
  check(gainApplied ? 0 : -1, "gainceiling");
  check(sensor->set_colorbar(sensor, g_colorbar), "colorbar");
  check(sensor->set_whitebal(sensor, g_awb), "awb");
  check(sensor->set_gain_ctrl(sensor, g_agc), "agc");
  check(sensor->set_exposure_ctrl(sensor, g_aec), "aec");
  check(sensor->set_awb_gain(sensor, g_awbGain), "awb_gain");
  check(sensor->set_agc_gain(sensor, g_agcGain), "agc_gain");
  check(sensor->set_aec_value(sensor, g_aecValue), "aec_value");
  check(sensor->set_aec2(sensor, g_aec2), "aec2");
  check(sensor->set_dcw(sensor, g_dcw), "dcw");
  check(sensor->set_bpc(sensor, g_bpc), "bpc");
  check(sensor->set_wpc(sensor, g_wpc), "wpc");
  check(sensor->set_raw_gma(sensor, g_rawGma), "raw_gma");
  check(sensor->set_lenc(sensor, g_lenc), "lenc");
  check(sensor->set_special_effect(sensor, g_specialEffect), "special_effect");
  check(sensor->set_wb_mode(sensor, g_wbMode), "wb_mode");
  check(sensor->set_ae_level(sensor, g_aeLevel), "ae_level");
  check(sensor->set_hmirror(sensor, g_hmirror), "hmirror");
  check(sensor->set_vflip(sensor, g_vflip), "vflip");
  applyLedState(g_ledEnabled != 0);
  evaluateIrAutomation();
  if (rebuildAfter) rebuildStreamer();
  if (!success) {
    setError("camera setting apply failed: " + failedSetting);
    return false;
  }
  clearError();
  return true;
}

