Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  if (topicText == mqttTopic("cmd/start")) {
    const bool wasEnabled = g_streamEnabled;
    g_streamEnabled = true;
    const bool saved = saveControllerSettings();
    if (!wasEnabled || g_streamer == nullptr) rebuildStreamer();
    if (saved) clearError();
    setCommandResult("start", requestId, saved ? "ok" : "partial",
                     saved ? "stream enabled" : "stream enabled; saving settings failed");
    recordStatus("mqtt start command");
  } else if (topicText == mqttTopic("cmd/stop")) {
    g_streamEnabled = false;
    const bool saved = saveControllerSettings();
    g_streamer.reset();
    setCommandResult("stop", requestId, saved ? "ok" : "partial",
                     saved ? "stream disabled" : "stream disabled; saving settings failed");
    recordStatus("mqtt stop command");
  } else if (topicText == mqttTopic("cmd/restart")) {
    setCommandResult("restart", requestId, "ok", "device rebooting");
    // Publish only the restart acknowledgement before reboot, not a full
    // sensor snapshot. Other command responses use the priority batch.
    publishSimple("status/state", "restarting");
    const char *replyTopics[] = {"status/command/id", "status/command/name",
                                "status/command/result", "status/command/message"};
    const String *replyValues[] = {&g_lastCommandId, &g_lastCommandName,
                                  &g_lastCommandResult, &g_lastCommandMessage};
    for (size_t index = 0; index < 4; ++index) {
      if (!publishSimple(replyTopics[index], *replyValues[index])) break;
      g_mqttClient.loop();
    }
    g_mqttClient.loop();
    delay(100);
    ESP.restart();
  } else if (topicText == mqttTopic("cmd/ping")) {
    publishSimple("status/pong", requestId.length() > 0 ? requestId : (payloadText.length() > 0 ? payloadText : "pong"));
    setCommandResult("ping", requestId, "ok", "pong");
  } else if (topicText == mqttTopic("cmd/set")) {
    applyControlPayload(payloadText);
  } else if (topicText == mqttTopic("cmd/timelapse/start")) {
    if (!dfrcapture::setEnabled(true)) {
      setError("unable to start server capture");
      setCommandResult("capture_start", requestId, "error", g_lastError);
    } else {
      setCommandResult("capture_start", requestId, "ok", "server capture requested");
    }
  } else if (topicText == mqttTopic("cmd/timelapse/stop")) {
    const bool saved = dfrcapture::setEnabled(false);
    setCommandResult("capture_stop", requestId, saved ? "ok" : "error",
                     saved ? "server capture disabled" : "saving capture settings failed");
  } else if (topicText == mqttTopic("cmd/timelapse/set")) {
    applyTimelapsePayload(payloadText);
  }
  publishStatus(true);
}

void mqttCallback(char *topic, byte *payload, unsigned int length) {
  if (length > 1536 || strlen(topic) > 192 ||
      g_pendingMqttCount == g_pendingMqttMessages.size()) {
    ++g_mqttCommandDrops;
    return;
  }
  PendingMqttMessage &message = g_pendingMqttMessages[
      (g_pendingMqttHead + g_pendingMqttCount) % g_pendingMqttMessages.size()];
  message.topic = topic;
  message.payload = "";
  if (message.topic.length() != strlen(topic) ||
      !message.payload.concat(reinterpret_cast<const char *>(payload), length)) {
    ++g_mqttCommandDrops;
    return;
  }
  ++g_pendingMqttCount;
}

void handlePendingMqttMessage() {
  if (g_pendingMqttCount == 0) return;
  PendingMqttMessage message = std::move(g_pendingMqttMessages[g_pendingMqttHead]);
  g_pendingMqttHead = (g_pendingMqttHead + 1) % g_pendingMqttMessages.size();
  --g_pendingMqttCount;
  Serial.printf("[MQTT] %s (%u bytes)\n", message.topic.c_str(), message.payload.length());
  processMqttMessage(message.topic, message.payload);
}

void ensureMqtt() {
  if (WiFi.status() != WL_CONNECTED) {
    if (g_mqttClient.connected()) g_mqttClient.disconnect();
    g_mqttSocket.stop();
    g_mqttSessionActive = false;
    discardStatusBatch();
    g_mqttAttemptCount = 0;
    g_lastMqttAttemptMs = 0;
    return;
  }
  g_mqttClient.loop();
  const uint32_t now = millis();
  if (g_mqttClient.connected()) {
    // Reset backoff only after a stable session, not after each brief CONNECT.
    if (now - g_mqttConnectedAtMs >= 10000UL) g_mqttAttemptCount = 0;
    static const char *subscriptions[] = {
        "cmd/start", "cmd/stop", "cmd/restart", "cmd/ping", "cmd/set",
        "cmd/timelapse/start", "cmd/timelapse/stop", "cmd/timelapse/set"};
    if (g_nextMqttSubscription < sizeof(subscriptions) / sizeof(subscriptions[0])) {
      const char *suffix = subscriptions[g_nextMqttSubscription];
      feedLoopWDT();
      if (!g_mqttClient.subscribe(mqttTopic(suffix).c_str(), 1)) {
        ++g_mqttSubscribeFailures;
        g_lastMqttFailurePhase = "subscribe";
        statusf("mqtt subscribe failed topic=%s", suffix);
        g_mqttSocket.stop();
        return;
      }
      ++g_nextMqttSubscription;
      g_mqttClient.loop();
    }
    return;
  }

  if (g_mqttSessionActive) {
    g_mqttSessionActive = false;
    g_lastMqttDisconnectState = g_mqttClient.state();
    g_lastMqttAttemptMs = now;
    discardStatusBatch();
    const auto &failure = g_mqttSocket.lastFailure();
    statusf("mqtt disconnected rc=%d tx=%s errno=%d",
            g_lastMqttDisconnectState, BoundedMqttSocket::reasonName(failure.reason),
            failure.errorNumber);
  }
  const uint32_t retryDelay = boundedReconnectDelay(
      g_mqttAttemptCount, dfrcfg::kMqttRetryInitialMs, dfrcfg::kMqttRetryMaxMs);
  if (g_lastMqttAttemptMs != 0 && now - g_lastMqttAttemptMs < retryDelay) return;
  g_lastMqttAttemptMs = now;
  ++g_mqttAttemptCount;

  g_mqttClient.disconnect();
  g_mqttSocket.stop();
  // Restore the ESP32 core's normal 3-second TCP connection deadline.
  // MQTT reads remain bounded separately; short WLAN delays are not fatal.
  g_mqttSocket.setTimeout(3);
  feedLoopWDT();

  const String willTopic = mqttTopic("status/online");
  bool connected = false;
  if (strlen(dfrcfg::kMqttUsername) > 0) {
    connected = g_mqttClient.connect(
        dfrcfg::kMqttClientId,
        dfrcfg::kMqttUsername,
        dfrcfg::kMqttPassword,
        willTopic.c_str(),
        1,
        true,
        "false");
  } else {
    connected = g_mqttClient.connect(dfrcfg::kMqttClientId, willTopic.c_str(), 1, true, "false");
  }
  feedLoopWDT();
  if (!connected) {
    g_lastMqttFailurePhase = "connect";
    g_lastMqttAttemptMs = millis();
    g_mqttSocket.stop();
    statusf("mqtt connect failed rc=%d", g_mqttClient.state());
    return;
  }

