Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  g_mqttSessionActive = true;
  g_mqttConnectedAtMs = millis();
  g_nextMqttSubscription = 0;
  if (g_mqttEverConnected) ++g_mqttReconnectCount;
  g_mqttEverConnected = true;
  // MQTT consists of many tiny messages. Allow TCP to coalesce them instead
  // of consuming one lwIP queue entry per small status message.
  g_mqttSocket.setNoDelay(false);
  g_statusSendStarted = false;

  statusf("mqtt connected topic=%s", dfrcfg::kMqttBaseTopic);
  publishStatus(true);
}

void handleRtspLoop() {
  if (WiFi.status() != WL_CONNECTED || !g_cameraReady) return;
  if (!g_streamEnabled) {
    WiFiClient waitingClient = g_rtspServer.accept();
    if (waitingClient) waitingClient.stop();
    return;
  }
  if (g_streamer == nullptr) rebuildStreamer();
  if (g_streamer == nullptr) return;

  g_streamer->handleRequests(0);
  const uint32_t now = millis();
  const uint32_t frameIntervalMs = 1000UL / static_cast<uint32_t>(max(1, g_streamFps));
  if (g_streamer->anySessions() &&
      (now - g_lastFrameAtMs >= frameIntervalMs || now < g_lastFrameAtMs)) {
    g_streamer->streamImage(now);
    g_lastFrameAtMs = now;
    if (g_streamer->lastFrameSucceeded()) {
      ++g_framesSent;
    } else if (g_streamer->consecutiveCaptureFailures() >= 5) {
      requestCameraRecovery("repeated frame capture failures");
    }
  }

  WiFiClient client = g_rtspServer.accept();
  if (client) {
    client.setNoDelay(true);
    const String remote = client.remoteIP().toString();
    g_streamer->addSession(new WiFiClient(client));
    statusf("rtsp client=%s", remote.c_str());
  }
}

void updateRuntimeStats() {
  const uint32_t now = millis();
  if (now - g_lastStatsMs < dfrcfg::kStatusIntervalMs) return;
  const float seconds = g_lastStatsMs == 0 ? 5.0f : (now - g_lastStatsMs) / 1000.0f;
  g_lastMeasuredFps = g_framesSent / seconds;
  g_framesSent = 0;
  g_lastStatsMs = now;
  statusf(
      "runtime wifi=%s mqtt=%s rtsp=%s sessions=%d fps=%.1f lux=%.2f ir=%s timelapse=%s",
      WiFi.status() == WL_CONNECTED ? "up" : "down",
      g_mqttClient.connected() ? "up" : "down",
      g_streamEnabled ? "on" : "off",
      directStreamingSessionCount(),
      g_lastMeasuredFps,
      g_ambientLux,
      g_irEnabled ? "on" : "off",
      dfrcapture::state().c_str());
  publishStatus();
}

void ensureVictron() {
  if (g_victronBeginAttempted || !dfrcfg::kVictronEnabled) return;
  if (millis() < dfrcfg::kVictronStartDelayMs) return;
  if (WiFi.status() != WL_CONNECTED || !g_mqttClient.connected()) return;

  g_victronBeginAttempted = true;
  recordStatus("victron BLE initializing");
  dfrvictron::begin();
}

}  // namespace

namespace dfr1154 {

void setupController() {
  Serial.begin(115200);
  delay(500);
  g_bootResetReason = esp_reset_reason();
  Serial.println("\n[BOOT] DFR1154 camera controller starting");

  pinMode(DFR_LED_PIN, OUTPUT);
  pinMode(DFR_IR_PIN, OUTPUT);
  digitalWrite(DFR_LED_PIN, LOW);
  digitalWrite(DFR_IR_PIN, LOW);

  Wire.begin(DFR_CAM_SIOD, DFR_CAM_SIOC, 100000);

  g_preferencesReady = g_preferences.begin("dfrcam", false);
  loadControllerSettings();
  initCamera();
  configureLightSensor();
  dfrbme::begin();
  dfrcapture::begin();

  statusf(
      "flash=%luMB psram=%luMB heap=%luKB",
      ESP.getFlashChipSize() / (1024UL * 1024UL),
      ESP.getPsramSize() / (1024UL * 1024UL),
      ESP.getFreeHeap() / 1024UL);

  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.onEvent(onWifiEvent);
  g_mqttSocket.setWaitCallback(serviceMqttWriteWait);
  g_mqttClient.setServer(dfrcfg::kMqttHost, dfrcfg::kMqttPort);
  g_mqttClient.setCallback(mqttCallback);
  g_mqttClient.setSocketTimeout(1);
  g_mqttClient.setKeepAlive(20);
  if (!g_mqttClient.setBufferSize(2048)) setError("MQTT buffer allocation failed");
  enableLoopWDT();
  g_loopWdtReady = true;
  ensureWifi();
}

void loopController() {
  if (g_otaReady) ArduinoOTA.handle();
  dfrbme::loop();
  handleWifiEvents();
  ensureWifi();
  handleNetworkServices();
  if (g_otaActive) {
    delay(1);
    return;
  }
  dfrvictron::loop();
  ensureMqtt();
  flushStatus();
  ensureVictron();
  handlePendingMqttMessage();
  if (g_otaReady) ArduinoOTA.handle();
  handleCameraRecovery();
  handleLightSensor();
  handleRtspLoop();
  updateRuntimeStats();
  flushStatus();
  delay(1);
}

}  // namespace dfr1154
